papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/cavityFlexibleBottom/base/quasiMonolithic/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     solids4Foam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10000;

deltaT          0.5;

writeControl    runTime;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

functions
{
    forces
    {
        type                forces;
        region              fluid;
        libs                ( "libforces.so" );
        outputControl       timeStep;
        outputInterval      1;
        patches             (interface);
        "pName|p"           p;
        "UName|U"           U;
        "rhoName|rho"       rhoInf;
        log                 false;
        rhoInf              1;
        CofR                (0.45 0.15 -0.15);
    }
    pointDisp
    {
        type                solidPointDisplacement;
        point               (4 -1 0.5);
    }
    steadyState
    {
        type                fsiSteadyStateControl;
        point               (4 -1 0.5);
        forcesObject        forces;
        solidRegion         solid;
        displacementComponent 1;
        forceComponent      1;
        minTime             20;
        nSamples            10;
        nConsecutive        1;
        displacementRelTol  1e-4;
        displacementAbsTol  1e-8;
        forceRelTol         1e-4;
        forceAbsTol         1e-7;
        displacementRefMin  1e-3;
        forceRefMin         1e-3;
        includeViscousForce yes;
        includeInternalForce no;
        writeAndEnd         yes;
        log                 true;
    }
}

// ************************************************************************* //
