papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/cavityFlexibleBottom/base/quasiMonolithic/system/decomposeParDict.monolithic
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Keep this top-level processor count consistent with the region
// decomposeParDicts because the parallel tutorial wrapper uses it to choose
// the MPI size for the monolithic run.

numberOfSubdomains 4;

// ************************************************************************* //
