papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/cavityFlexibleBottom/base/quasiMonolithic/system/fluid/blockMeshDict.1
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    (0 1 0)                       // 0
    (1.75 1 0)                    // 1
    (0 1.2 0)                     // 2
    (1.75 1.2 0)                  // 3
    (0 2 0)                       // 4
    (1.75 2 0)                    // 5
    (1.926776695 0.9267766953 0)  // 6
    (2 0.75 0)                    // 7
    (2 0 0)                       // 8
    (2.2 0 0)                     // 9
    (2.2 0.75 0)                  // 10
    (2.068198052 1.032842712 0)   // 11
    (2.1 2 0)                     // 12
    (5.9 2 0)                     // 13
    (5.931801948 1.032842712 0)   // 14
    (5.8 0.75 0)                  // 15
    (5.8 0 0)                     // 16
    (6 0 0)                       // 17
    (6 0.75 0)                    // 18
    (6.073223305 0.9267766953 0)  // 19
    (6.25 1 0)                    // 20
    (6.25 1.2 0)                  // 21
    (6.25 2 0)                    // 22
    (14 2 0)                      // 23
    (14 1.2 0)                    // 24
    (14 1 0)                      // 25

    (0 1 1)                       // 26
    (1.75 1 1)                    // 27
    (0 1.2 1)                     // 28
    (1.75 1.2 1)                  // 29
    (0 2 1)                       // 30
    (1.75 2 1)                    // 31
    (1.926776695 0.9267766953 1)  // 32
    (2 0.75 1)                    // 33
    (2 0 1)                       // 34
    (2.2 0 1)                     // 35
    (2.2 0.75 1)                  // 36
    (2.068198052 1.032842712 1)   // 37
    (2.1 2 1)                     // 38
    (5.9 2 1)                     // 39
    (5.931801948 1.032842712 1)   // 40
    (5.8 0.75 1)                  // 41
    (5.8 0 1)                     // 42
    (6 0 1)                       // 43
    (6 0.75 1)                    // 44
    (6.073223305 0.9267766953 1)  // 45
    (6.25 1 1)                    // 46
    (6.25 1.2 1)                  // 47
    (6.25 2 1)                    // 48
    (14 2 1)                      // 49
    (14 1.2 1)                    // 50
    (14 1 1)                      // 51
);

blocks
(
    hex (0 1 3 2 26 27 29 28) (17 2 1) simpleGrading (1 1 1)
    hex (2 3 5 4 28 29 31 30) (17 8 1) simpleGrading (1 1 1)
    hex (1 6 11 3 27 32 37 29) (3 2 1) simpleGrading (1 1 1)
    hex (8 9 10 7 34 35 36 33) (2 7 1) simpleGrading (1 1 1)
    hex (9 16 15 10 35 42 41 36) (36 7 1) simpleGrading (1 1 1)
    hex (6 7 10 11 32 33 36 37) (3 2 1) simpleGrading (1 1 1)
    hex (10 15 14 11 36 41 40 37) (36 3 1) simpleGrading (1 1 1)
    hex (15 18 19 14 41 44 45 40) (2 3 1) simpleGrading (1 1 1)
    hex (16 17 18 15 42 43 44 41) (2 7 1) simpleGrading (1 1 1)
    hex (20 25 24 21 46 51 50 47) (77 2 1) simpleGrading (1 1 1)
    hex (21 24 23 22 47 50 49 48) (77 8 1) simpleGrading (1 1 1)
    hex (19 20 21 14 45 46 47 40) (3 2 1) simpleGrading (1 1 1)
    hex (14 21 22 13 40 47 48 39) (3 8 1) simpleGrading (1 1 1)
    hex (3 11 12 5 29 37 38 31) (3 8 1) simpleGrading (1 1 1)
    hex (11 14 13 12 37 40 39 38) (36 8 1) simpleGrading (1 1 1)

);

edges
(
    arc 6 7 (1.996201938  0.79341204444 0)
    arc 33 32 (1.996201938  0.79341204444 1)
    arc 36 37 (2.193163489 0.82814168 1)
    arc 11 10 (2.193163489 0.82814168 0)
    arc 29 37 (1.82814168 1.193163489 1)
    arc 3 11 (1.82814168 1.193163489 0)
    arc 1 6 (1.793412044 0.9962019383 0)
    arc 27 32 (1.793412044 0.9962019383 1)
    arc 18 19 (6.015076845 0.8355050358 0)
    arc 44 45 (6.015076845 0.8355050358 1)
    arc 41 40 (5.827138321 0.9039090645 1)
    arc 14 15 (5.827138321 0.9039090645 0)
    arc 45 46 (6.164494964 0.9849231552 1)
    arc 19 20 (6.164494964 0.9849231552 0)
    arc 40 47 (6.096090936 1.172861679  1)
    arc 14 21 (6.096090936 1.172861679  0)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 26 28 2)
            (2 28 30 4)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (24 23 49 50)
            (25 24 50 51)
        );
    }

    interface
    {
        type patch;
        faces
        (
            (34 8 9 35)
            (35 9 16 42)
            (42 16 17 43)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (0 1 27 26)
            (27 1 6 32)
            (32 6 7 33)
            (34 33 7 8)
            (43 17 18 44)
            (44 18 19 45)
            (19 20 46 45)
            (46 20 25 51)
            (30 31 5 4)
            (31 38 12 5)
            (38 39 13 12)
            (39 48 22 13)
            (48 49 23 22)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (26 27 29 28)
            (28 29 31 30)
            (27 32 37 29)
            (29 37 38 31)
            (34 35 36 33)
            (35 42 41 36)
            (42 43 44 41)
            (41 44 45 40)
            (40 45 46 47)
            (46 51 50 47)
            (47 50 49 48)
            (40 47 48 39)
            (33 36 37 32)
            (36 41 40 37)
            (37 40 39 38)
            (4 5 3 2)
            (0 2 3 1)
            (1 3 11 6)
            (5 12 11 3)
            (12 13 14 11)
            (13 22 21 14)
            (22 23 24 21)
            (21 24 25 20)
            (14 21 20 19)
            (8 7 10 9)
            (9 10 15 16)
            (15 18 17 16)
            (15 14 19 18)
            (11 14 15 10)
            (6 11 10 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
